[{"authors":[],"categories":[],"content":"Politica de privacidade\nA Byteverso opera o site \u0026ldquo;Byteverso\u0026rdquo; em https://www.byteverso.com. Eu levo sua privacidade a sério. Para melhor proteger sua privacidade, forneço este aviso de política de privacidade explicando como suas informações pessoais são coletadas e usadas.\nColeta de informações de rotina\nEste site rastreia informações básicas sobre seus visitantes. Essas informações incluem, mas não estão limitadas a, endereços IP, detalhes do navegador, carimbos de data/hora e páginas de referência. Nenhuma dessas informações pode identificar pessoalmente os visitantes específicos deste site. As informações são rastreadas para fins de administração e manutenção de rotina.\nCookies\nSempre que necessário, este site usa cookies para armazenar informações sobre as preferências e o histórico de um visitante para melhor atendê-lo e/ou apresentar ao visitante conteúdo personalizado.\nPublicidade e terceiros\nParceiros de publicidade e outros terceiros podem usar cookies, scripts e/ou web beacons para rastrear as atividades do visitante neste site para exibir anúncios e outras informações úteis. Tal rastreamento é feito diretamente por terceiros através de seus servidores e está sujeito às suas políticas de privacidade. Este site não tem acesso ou controle sobre esses cookies, scripts e/ou web beacons que podem ser usados ​​por terceiros.\nIncluí links neste site para seu uso e referência. Não sou responsável pelas políticas de privacidade desses sites. Você deve estar ciente de que as políticas de privacidade desses sites podem diferir das minhas.\nLink para a política de privacidade de provedores de serviços terceirizados usados ​​pelo site\nGoogle Analytics Mudanças a esta política\nEsta Política de Privacidade é efetiva a partir de 11/12/2022 e permanecerá em vigor, exceto no que diz respeito a quaisquer alterações em suas disposições no futuro, que entrarão em vigor imediatamente após sua publicação nesta página. Eu me reservo o direito de atualizar ou alterar minha Política de Privacidade a qualquer momento e você deve verificar esta Política de Privacidade periodicamente. Se eu fizer qualquer alteração material a esta Política de Privacidade, notificarei você por meio do endereço de e-mail que você me forneceu ou colocando um aviso em destaque em meu site.\nContato\nPara qualquer dúvida ou preocupação sobre a política de privacidade, envie-me uma mensagem em instagram.com/byteverso\nThis privacy policy page was created by Arthur Gareginyan and modified/generated by Free \u0026amp; Open Source Privacy Policy Generator.\n","date":"February 28, 2019","img":"","lang":"en","langName":"","largeImg":"","permalink":"/politica-de-privacidade/","series":[],"smallImg":"","tags":[],"timestamp":1551312000,"title":"Politica de privacidade"},{"authors":[],"categories":[],"content":"Em inúmeras situações as nossas requisições HTTP comunicam-se com API\u0026rsquo;s que recebem um alto volume de tráfego, portanto ás vezes retornando respostas indesejadas, os famosos 5xx.\nFelizmente existe uma biblioteca em Go feito pela Hashicorp chamada go-retryablehttp que pode nos ajudar, observe o exemplo abaixo 👇\npackage main import ( \u0026#34;fmt\u0026#34; \u0026#34;log\u0026#34; \u0026#34;time\u0026#34; \u0026#34;github.com/hashicorp/go-retryablehttp\u0026#34; ) func main() { //Cria um novo http client c := retryablehttp.NewClient() //Configura o client para 10 tentativas c.RetryMax = 10 //Configura o mínimo de tempo de espera c.RetryWaitMin = 1 * time.Second //Configura o máximo tempo de espera c.RetryWaitMax = 10 * time.Second request, err := retryablehttp.NewRequest(\u0026#34;GET\u0026#34;, \u0026#34;http://example.com\u0026#34;, nil) if err != nil { log.Fatalln(err) } resp, err := c.Do(request) if err != nil { log.Fatalln(err) } fmt.Printf(\u0026#34;Requisição retornada com status %d\\n\u0026#34;, resp.StatusCode) } A biblioteca por sí só já tem funções padrões para gerenciar o Backoff porém você pode também passar funções customizadas para lidar com as respostas de erro.\ntype Client struct { HTTPClient *http.Client // Internal HTTP client. Logger interface{} // Customer logger instance. Can be either Logger or LeveledLogger RetryWaitMin time.Duration // Minimum time to wait RetryWaitMax time.Duration // Maximum time to wait RetryMax int // Maximum number of retries // RequestLogHook allows a user-supplied function to be called // before each retry. RequestLogHook RequestLogHook // ResponseLogHook allows a user-supplied function to be called // with the response from each HTTP request executed. ResponseLogHook ResponseLogHook // CheckRetry specifies the policy for handling retries, and is called // after each request. The default policy is DefaultRetryPolicy. CheckRetry CheckRetry // Backoff specifies the policy for how long to wait between retries Backoff Backoff // ErrorHandler specifies the custom error handler to use, if any ErrorHandler ErrorHandler loggerInit sync.Once clientInit sync.Once } ","date":"January 1, 1","img":"","lang":"en","langName":"","largeImg":"","permalink":"/golang/tutoriais/go-http-inteligente/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Re-envio de requisições HTTP em GO"},{"authors":[],"categories":[],"content":"Antes de você se aprofundar nos motivos abaixo, gostaríamos de lembrar que esta é uma opinião dos editores baseada em nossas próprias experiências profissionais.\nSe você não sabe o que é Linux, recomendamos esse curso gratuíto (sem e-mail, sem pegadinha) do Guia foca linux.\nVocê não precisa ser hacker, nem nada para usar linux. A maioria das distribuições Linux tem interface gráfica e é muito amigável\nUbuntu 22.10\nVelocidade e Praticidade Ao instalar o linux no seu computador, a primeira coisa que você vai notar é o sentimento de que seu computador agora é mais veloz do que era antes.\nA diferença é nítida ao abrir os programas mais básicos e necessários do seu dia-a-dia como:\nNavegador Explorador de arquivos Editor de texto Editor de planilhas Editor de código Quantas vezes você teve que instalar um leitor de PDF? ou o famigerado Winrar para poder abrir arquivos no formato zip e que tal um anti-vírus? e então app após app o sistema ficava cada vez mais lento. Bom esqueça tudo isso, o Linux já contém a maioria dos programas necessários para o uso diário e o melhor de tudo é que a maioria deles são programas open source que são testados e analisados por milhares de usuários para garantir a excelência dos programas.\nTem mais? tem.\nTODAS as distribuições Linux que já utilizamos possuí um gerenciador de pacotes que permite instalar praticamente TODOS os programas mais comuns, além disso a maioria das bibliotecas, linguagens de programação e ferramentas de desenvolvimento rodam NATIVAMENTE no Linux, até porque a maioria delas é feita no Linux 😉\nDentre os gerenciadores de pacotes os nossos preferidos são:\npacman yay Ambos estão disponíveis no Arch Linux, Manjaro e outros derivados do Arch.\nAutomação e Customização Pessoalmente nós do Byteverso acreditamos que duas das maiores vantagens do Linux são:\nLinguagem Bash Terminal É incrível como você pode automatizar quase qualquer coisa em uma distribuição Linux, por exemplo:\nScript simples de backup de arquivos\n!#/bin/bash usuario=${USER} pastas_para_salvar=(\u0026#34;~/Documents\u0026#34;, \u0026#34;~/Imagens\u0026#34;, \u0026#34;~/Codigo\u0026#34;) pasta_destino=\u0026#34;~/backup\u0026#34; data=$(date +\u0026#34;%b_%d_%y_hora_%H_%M\u0026#34;) for i in \u0026#34;${pastas_para_salvar[@]}\u0026#34;; do sudo tar -Pczf $pasta_destino/$i-$data.tar.gz $i if [ $? -eq 0 ]; then echo \u0026#34;$i backup feito com sucesso!\u0026#34; else echo \u0026#34;$i backup falhou.\u0026#34; fi done Este exemplo é realmente muito simples, com um pouco mais de conhecimento você pode fácilmente automatizar e-mails, mensagens no telegram, web-crawlers, e até mesmo\u0026hellip;. Piadas do Chuck Norris 😂\n!#/bin/bash curl -s https://api.chucknorris.io/jokes/random | jq .value -r #In the X-Men movies, none of the X-Men super-powers are done with special effects. Chuck Norris is the stuntman for every character. Crescimento profissional O simples ato de utilizar Linux vai te condicionar a pensar mais como um desenvolvedor e menos como um usuário, problemas acontecerão e você terá que lidar com eles. Felizmente a comunidade de utilizadores de Linux e os próprios desenvolvedores é receptiva e aberta (na maioria das vezes) e provavelmente alguém já teve o mesmo problema que você.\nVocê saber usar Linux é uma vantagem no mercado profissional também, pois os sistemas que você irá desenvolver possivelmente irão comunicar-se com outros sistemas que rodam aonde? Exatamente, no Linux e na AWS, então é melhor que você tenha familiaridade com o sistema não é?\n","date":"January 1, 1","img":"","lang":"en","langName":"","largeImg":"","permalink":"/dicas/produtividade/vantagens-dev-linux/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Vantagens de usar Linux"}]
